---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArray.#ctor
source: html/fe60c92f-9eeb-debf-e5c3-69d63d954d68.htm
---
# Autodesk.Revit.DB.ReferenceArray.#ctor Method

Initializes a new instance of the ReferenceArray class

## Syntax (C#)
```csharp
public ReferenceArray()
```